import React from "react";
import DepartmentSidebar from "./departments/DepartmentSidebar"; // Import the sidebar component

import "./Structure.css"; // Import custom styles for the Structure page
import SectionMOU from "../components/SectionMOU";

const img_structure1 = [
  { id: 1, path: "/images/img-structure/1.jpg" },
  { id: 2, path: "/images/img-structure/2.jpg" },
  { id: 3, path: "/images/img-structure/3.jpg" },
  { id: 4, path: "/images/img-structure/4.jpg" },
  { id: 5, path: "/images/img-structure/5.jpg" },
];

const Structure = () => {
  return (
    <div className="container mt-4">
      <div className="row">
        

        {/* Main Content */}
        <div className="col-md-8">
          <h1 className="mb-4 khmer-title">
            រចនាសម្ព័ន្ធគ្រប់គ្រងរបស់វិទ្យាស្ថានពហុបច្ចេកទេសភូមិភាគតេជោសែនស្វាយរៀង
          </h1>
          <div className="mt-3">
            <p style={{ fontFamily: "Siemreap"}}>
              រចនាសម្ព័ន្ធគ្រប់គ្រងរបស់វិទ្យាស្ថានពហុបច្ចេកទេសភូមិភាគតេជោសែនស្វាយរៀង ត្រូវបានរចនាឡើងដើម្បីធានាថាវិទ្យាស្ថានអាចដំណើរការបានយ៉ាងមានប្រសិទ្ធភាព និងមានប្រសិទ្ធភាព។ វារួមមានផ្នែកនានាដែលមានតួនាទី និងការទំនាក់ទំនងច្បាស់លាស់ដើម្បីធានាថាការគ្រប់គ្រង និងការអប់រំត្រូវបានអនុវត្តដោយមានគុណភាពខ្ពស់។
            </p>
            <p style={{ fontFamily: "Siemreap"}}>
              ផ្នែកគ្រប់គ្រងរបស់វិទ្យាស្ថានរួមមានអគ្គនាយក ដែលមានការគ្រប់គ្រងទូទៅលើសកម្មភាពរបស់វិទ្យាស្ថាន។ អគ្គនាយកត្រូវបានគាំទ្រដោយនាយកដ្ឋាននានា ដែលមានតួនាទីក្នុងការគ្រប់គ្រងផ្នែកជាក់លាក់ដូចជាការអប់រំ ការគ្រប់គ្រងសិស្ស និងសេវាកម្មសិស្ស។ 
              ក្រុមគ្រប់គ្រងនេះធ្វើការជិតស្និទ្ធជាមួយគ្នាដើម្បីធានាថាវិទ្យាស្ថានអាចបំពេញបេសកកម្មរបស់ខ្លួនក្នុងការផ្តល់អប់រំវិជ្ជាជីវៈដែលមានគុណភាព និងអនុវត្តបានពិត។
            </p>

            <p style={{ fontFamily: "Siemreap"}}>
              ការគ្រប់គ្រងរបស់វិទ្យាស្ថានក៏រួមមានក្រុមប្រឹក្សាភិបាល ដែលមានតួនាទីក្នុងការផ្តល់ការណែនាំយុទ្ធសាស្រ្ត និងការត្រួតពិនិត្យលើសកម្មភាពរបស់វិទ្យាស្ថាន។ ក្រុមប្រឹក្សាភិបាលនេះរួមមានអ្នកជំនាញពីវិស័យផ្សេងៗ ដូចជាអ្នកតំណាងឧស្សាហកម្ម អ្នកតំណាងសហគមន៍ និងអ្នកជំនាញអប់រំ។ 
              ការចូលរួមរបស់ពួកគេធានាថាវិទ្យាស្ថានអាចបំពេញតម្រូវការរបស់សិស្ស និងឧស្សាហកម្មក្នុងតំបន់បានយ៉ាងល្អ។
            </p>
          </div>
          <img
            src="/images/structure_rpi.jpg"
            alt="Structure of RPI"
            className="img-fluid rounded shadow"
          />
          <div className="row mt-4 g-3">
            {img_structure1.map((img) => (
              <div className="col-6" key={img.id}>
                <div className="structure-image-card">
                  <img
                    src={img.path}
                    alt={`Structure ${img.id}`}
                    className="img-fluid rounded shadow"
                  />
                </div>
              </div>
            ))}
          </div>
          <SectionMOU />
          
        </div>
        {/* Sidebar */}
        <div className="col-md-4">
          <DepartmentSidebar />
        </div>
      </div>
    </div>
  );
};

export default Structure;
